# PANDAS- python data analysis
- similar to excel

In [ ]:
pip install pandas

In [ ]:
pip list

In [1]:
import numpy as np
import pandas as pd

C:\Users\anurag.shagun\AppData\Local\Temp\ipykernel_35832\1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [8]:
mylabels= ['a','b','c','d']
my_list =[10,20,30,40]
arr= np.array(my_list)
dict1= {'a':10,'b':20,'c':30}

# Series- one-dimensional labeled array holding data of any type

In [9]:
series = pd.Series(my_list)  #
series

0    10
1    20
2    30
3    40
dtype: int64

In [11]:
series= pd.Series(data=my_list, index =mylabels )
series

a    10
b    20
c    30
d    40
dtype: int64

In [13]:
sr= pd.Series(index= ['USA', 'UK', 'Canda', 'Japan'], data=[330,67,38,125])
sr

USA      330
UK        67
Canda     38
Japan    125
dtype: int64

In [14]:
sr['USA']

330

# add a header

In [16]:
sr2=pd.Series([1,2,3.4,4.8,5,6,8.2])   #panda series give a array with an index/label
sr2

0    1.0
1    2.0
2    3.4
3    4.8
4    5.0
5    6.0
6    8.2
dtype: float64

# Data Frame
- bunch of series, sharing same index (excel sheet)
- Series in dataframe can have col names

In [24]:
df= pd.DataFrame(np.random.randn(5,4), index =['A','B','C','D', 'E'], columns=['col1','col2','col3','col4'])
df

       col1      col2      col3      col4
A  0.407302 -0.918306  1.119649 -0.887230
B -0.180885 -1.571091  2.087179  0.500357
C  0.814107 -0.857738 -0.115563  0.449208
D  0.557065  0.394140 -0.727495  0.838015
E  0.827729  1.458285 -1.959837 -1.298077

In [25]:
df['col2']

A   -0.918306
B   -1.571091
C   -0.857738
D    0.394140
E    1.458285
Name: col2, dtype: float64

In [26]:
df.col2           #SQL style

A   -0.918306
B   -1.571091
C   -0.857738
D    0.394140
E    1.458285
Name: col2, dtype: float64

In [29]:
col_name='col3'   #parametrized
print(type(df[col_name]))
df[col_name]

<class 'pandas.core.series.Series'>

A    1.119649
B    2.087179
C   -0.115563
D   -0.727495
E   -1.959837
Name: col3, dtype: float64

In [46]:
df['newCol'] =df['col1'] + df['col2']    #calulated column
df

       col1      col2      col3      col4    newCol
A  0.407302 -0.918306  1.119649 -0.887230 -0.511003
B -0.180885 -1.571091  2.087179  0.500357 -1.751976
C  0.814107 -0.857738 -0.115563  0.449208 -0.043631
D  0.557065  0.394140 -0.727495  0.838015  0.951204
E  0.827729  1.458285 -1.959837 -1.298077  2.286014

In [32]:
df.loc['A']      #fetch a row

col1      0.407302
col2     -0.918306
col3      1.119649
col4     -0.887230
newCol   -0.511003
Name: A, dtype: float64

In [35]:
df.iloc[2]      # fetch by row index

col1      0.814107
col2     -0.857738
col3     -0.115563
col4      0.449208
newCol   -0.043631
Name: C, dtype: float64

In [36]:
df.loc['C']['col2']       #fetch by row and col

-0.85773765154129

In [37]:
df.loc[['A','C']]['col3']

A    1.119649
C   -0.115563
Name: col3, dtype: float64

# drop a col

In [38]:
df

       col1      col2      col3      col4    newCol
A  0.407302 -0.918306  1.119649 -0.887230 -0.511003
B -0.180885 -1.571091  2.087179  0.500357 -1.751976
C  0.814107 -0.857738 -0.115563  0.449208 -0.043631
D  0.557065  0.394140 -0.727495  0.838015  0.951204
E  0.827729  1.458285 -1.959837 -1.298077  2.286014

In [41]:
#changes to a DataFrame will create and return a new data frame
df2= df.drop('newCol', axis=1)      # axis implies col
df2

       col1      col2      col3      col4
A  0.407302 -0.918306  1.119649 -0.887230
B -0.180885 -1.571091  2.087179  0.500357
C  0.814107 -0.857738 -0.115563  0.449208
D  0.557065  0.394140 -0.727495  0.838015
E  0.827729  1.458285 -1.959837 -1.298077

In [47]:
df

       col1      col2      col3      col4    newCol
A  0.407302 -0.918306  1.119649 -0.887230 -0.511003
B -0.180885 -1.571091  2.087179  0.500357 -1.751976
C  0.814107 -0.857738 -0.115563  0.449208 -0.043631
D  0.557065  0.394140 -0.727495  0.838015  0.951204
E  0.827729  1.458285 -1.959837 -1.298077  2.286014

In [48]:
df.drop('newCol', axis=1, inplace=True)      # in place= true will modify a dataframe
df

       col1      col2      col3      col4
A  0.407302 -0.918306  1.119649 -0.887230
B -0.180885 -1.571091  2.087179  0.500357
C  0.814107 -0.857738 -0.115563  0.449208
D  0.557065  0.394140 -0.727495  0.838015
E  0.827729  1.458285 -1.959837 -1.298077

# any changes in dataframe, by default is 'NOT' in place
# when adding, it modifies a dataframe, but while deleting it creates a copy

In [49]:
df.drop('A')    # delete a Row

       col1      col2      col3      col4
B -0.180885 -1.571091  2.087179  0.500357
C  0.814107 -0.857738 -0.115563  0.449208
D  0.557065  0.394140 -0.727495  0.838015
E  0.827729  1.458285 -1.959837 -1.298077

In [50]:
df

       col1      col2      col3      col4
A  0.407302 -0.918306  1.119649 -0.887230
B -0.180885 -1.571091  2.087179  0.500357
C  0.814107 -0.857738 -0.115563  0.449208
D  0.557065  0.394140 -0.727495  0.838015
E  0.827729  1.458285 -1.959837 -1.298077

# Missing data

In [51]:
df= pd.DataFrame({'A':[1,2, np.nan],'B':[4,5,6], 'C':[ 7,np.nan, 9]})
df

     A  B    C
0  1.0  4  7.0
1  2.0  5  NaN
2  NaN  6  9.0

In [53]:
df.dropna()       #drop rows which have atleast one missing data

     A  B    C
0  1.0  4  7.0

In [54]:
df.dropna(axis=1)       #drop cols which have atleast one missing data

   B
0  4
1  5
2  6

In [56]:
df.dropna(thresh=2)       #retain rows with atleast 2 not null values

     A  B    C
0  1.0  4  7.0
1  2.0  5  NaN
2  NaN  6  9.0

In [57]:
df.fillna(0)

     A  B    C
0  1.0  4  7.0
1  2.0  5  0.0
2  0.0  6  9.0

In [58]:
df.fillna(df.mean())    # fill missing data as average of other rows

     A  B    C
0  1.0  4  7.0
1  2.0  5  8.0
2  1.5  6  9.0

# Reading data

In [67]:
df= pd.read_csv('Example.csv')
df

    a   b   c   d
0   0   1   2   3
1   x   y   z   p
2  11  22  33  44

In [65]:
df= df.to_csv('Example2.csv')      # save a file

In [71]:
df

    a   b   c   d
0   0   1   2   3
1   x   y   z   p
2  11  22  33  44

# Excel Library install

In [75]:
# install Excel related library
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\python312\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\python312\lib\site-packages (from openpyxl) (1.1.0)

In [76]:
df.to_excel('example.xlsx', sheet_name='mysheet', index=False)

In [77]:
!pip install lxml

Collecting lxml
  Downloading lxml-5.1.0-cp312-cp312-win_amd64.whl.metadata (3.6 kB)
Downloading lxml-5.1.0-cp312-cp312-win_amd64.whl (3.9 MB)
   ---------------------------------------- 0.0/3.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.9 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.9 MB 325.1 kB/s eta 0:00:12
   ---------------------------------------- 0.0/3.9 MB 326.8 kB/s eta 0:00:12
    --------------------------------------- 0.1/3.9 MB 476.3 kB/s eta 0:00:09
   - -------------------------------------- 0.2/3.9 MB 701.4 kB/s eta 0:00:06
   -- ------------------------------------- 0.2/3.9 MB 860.2 kB/s eta 0:00:05
   -- ------------------------------------- 0.3/3.9 MB 883.3 kB/s eta 0:00:05
   --- ------------------------------------ 0.4/3.9 MB 998.3 kB/s eta 0:00:04
   ----- ---------------------------------- 0.6/3.9 MB 1.4 MB/s eta 0:00:03
   ------- -------------------------------- 0.7/3.9 MB 1.7 MB/s eta 0:00:02
   ----------- ---------------------------- 1.1/3.9 MB 2.3 MB/s eta 0:00:02
   --------------- ------------------------ 1.5/3.9 MB 2.8 MB/s eta 0:00:01
   ------------------- -------------------- 1.9/3.9 MB 3.1 MB/s eta 0:00:01
   ------------------------------ --------- 3.0/3.9 MB 4.8 MB/s eta 0:00:01
   ------------------------------------ --- 3.6/3.9 MB 5.3 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  3.9/3.9 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------- 3.9/3.9 MB 3.3 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.1.0

# install html library

In [78]:
! pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     ---------------------------------------- 0.0/112.2 kB ? eta -:--:--
     ---------------------------------------- 0.0/112.2 kB ? eta -:--:--
     --- ------------------------------------ 10.2/112.2 kB ? eta -:--:--
     ------ ------------------------------ 20.5/112.2 kB 131.3 kB/s eta 0:00:01
     ---------- -------------------------- 30.7/112.2 kB 187.9 kB/s eta 0:00:01
     ---------------- -------------------- 51.2/112.2 kB 238.1 kB/s eta 0:00:01
     ----------------------- ------------- 71.7/112.2 kB 281.8 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     -------------------------------- --- 102.4/112.2 kB 368.6 kB/s eta 0:00:01
     ------------------------------------ 112.2/112.2 kB 101.9 kB/s eta 0:00:00
Requirement already satisfied: six>=1.9 in c:\python312\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\python312\lib\site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.1

In [79]:
df_array= pd.read_html('https://www.w3schools.com/html/html_tables.asp')
df_array

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
           Tag                                        Description
 0     <table>                                    Defines a table
 1        <th>                   Defines a header cell in a table
 2        <tr>                           Defines a row in a table
 3        <td>                          Defines a cell in a table
 4   <caption>                            Defines a table caption
 5  <colgroup>  Specifies a group of one or more columns in a ...
 6       <col>  Specifies column properties for each column wi...
 7     <thead>               Groups the header content in a table
 8     <tbody>                 Groups the body content in a table
 9     <tfoot>               Groups the footer content in a table]